{
    "architectures": [
      "MistralForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 6144,
    "max_position_embeddings": 32768,
    "model_type": "mistral",
    "num_attention_heads": 16,
    "num_hidden_layers": 4,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-05,
    "rope_theta": 100000000.0,
    "sliding_window": null,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 131072
  }